FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_M4_AMP_STM32H745I_Discovery_IAR/ST_code/BSP/STM32H745I-Discovery/stm32h745i_discovery_qspi.c
/**
 ******************************************************************************
 * @file    stm32h745i_discovery_qspi.c
 * @author  MCD Application Team
 * @brief   This file includes a standard driver for the MT25TL01G QSPI
 *          memory mounted on STM32H745I-DISCOVERY board.
 * @verbatim
 * ==============================================================================
 ##### How to use this driver #####
 #####==============================================================================
 #####[..]
 #####(#) This driver is used to drive the MT25TL01G QSPI external
 ##### memory mounted on STM32H745I_DISCOVERY board.
 #####
 #####(#) This driver need a specific component driver (MT25TL01G) to be included with.
 #####
 #####(#) Initialization steps:
 ##### (++) Initialize the QPSI external memory using the BSP_QSPI_Init() function. This
 #####      function includes the MSP layer hardware resources initialization and the
 #####      QSPI interface with the external memory.
 #####
 #####(#) QSPI memory operations
 ##### (++) QSPI memory can be accessed with read/write operations once it is
 #####      initialized.
 #####      Read/write operation can be performed with AHB access using the functions
 #####      BSP_QSPI_Read()/BSP_QSPI_Write().
 ##### (++) The function BSP_QSPI_GetInfo() returns the configuration of the QSPI memory.
 #####      (see the QSPI memory data sheet)
 ##### (++) Perform erase block operation using the function BSP_QSPI_Erase_Block() and by
 #####      specifying the block address. You can perform an erase operation of the whole
 #####      chip by calling the function BSP_QSPI_Erase_Chip().
 ##### (++) The function BSP_QSPI_GetStatus() returns the current status of the QSPI memory.
 #####      (see the QSPI memory data sheet)
 #####@endverbatim
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32h745i_discovery_qspi.h"

/** @addtogroup BSP
 * @{
 */

/** @addtogroup STM32H745I_DISCOVERY
 * @{
 */

/** @defgroup STM32H745I_DISCOVERY_QSPI STM32H745I_DISCOVERY_QSPI
 * @{
 */


/* Private variables ---------------------------------------------------------*/

/** @defgroup STM32H745I_DISCOVERY_QSPI_Private_Variables Private Variables
 * @{
 */
QSPI_HandleTypeDef QSPIHandle;

/**
 * @}
 */



/* Private functions ---------------------------------------------------------*/

/** @defgroup STM32H745I_DISCOVERY_QSPI_Private_Functions Private Functions
 * @{
 */
static uint8_t QSPI_ResetMemory( QSPI_HandleTypeDef * hqspi );
static uint8_t QSPI_EnterFourBytesAddress( QSPI_HandleTypeDef * hqspi );
static uint8_t QSPI_DummyCyclesCfg( QSPI_HandleTypeDef * hqspi );
static uint8_t QSPI_WriteEnable( QSPI_HandleTypeDef * hqspi );
static uint8_t QSPI_AutoPollingMemReady( QSPI_HandleTypeDef * hqspi,
                                         uint32_t Timeout );
static uint8_t QSPI_EnterQPI( QSPI_HandleTypeDef * hqspi );

/**
 * @}
 */

/** @defgroup STM32H745I_DISCOVERY_QSPI_Exported_Functions Exported Functions
 * @{
 */

/**
 * @brief  Initializes the QSPI interface.
 * @retval QSPI memory status
 */
uint8_t BSP_QSPI_Init( void )
{
    QSPIHandle.Instance = QUADSPI;

    /* Call the DeInit function to reset the driver */
    if( HAL_QSPI_DeInit( &QSPIHandle ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    /* System level initialization */
    BSP_QSPI_MspInit( &QSPIHandle, NULL );

    /* QSPI initialization */
    /* ClockPrescaler set to 1, so QSPI clock = 200MHz / (1+3) = 50MHz */
    QSPIHandle.Init.ClockPrescaler = 3;
    QSPIHandle.Init.FifoThreshold = 1;
    QSPIHandle.Init.SampleShifting = QSPI_SAMPLE_SHIFTING_HALFCYCLE;
    QSPIHandle.Init.FlashSize = POSITION_VAL( MT25TL01G_FLASH_SIZE ) - 1;
    QSPIHandle.Init.ChipSelectHighTime = QSPI_CS_HIGH_TIME_3_CYCLE;
    QSPIHandle.Init.ClockMode = QSPI_CLOCK_MODE_0;
    QSPIHandle.Init.FlashID = QSPI_FLASH_ID_2;
    QSPIHandle.Init.DualFlash = QSPI_DUALFLASH_ENABLE;

    if( HAL_QSPI_Init( &QSPIHandle ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    /* QSPI memory reset */
    if( QSPI_ResetMemory( &QSPIHandle ) != QSPI_OK )
    {
        return QSPI_NOT_SUPPORTED;
    }

    /* Set the QSPI memory in 4-bytes address mode */
    if( QSPI_EnterFourBytesAddress( &QSPIHandle ) != QSPI_OK )
    {
        return QSPI_NOT_SUPPORTED;
    }

    /* Configuration of the dummy cycles on QSPI memory side */
    if( QSPI_DummyCyclesCfg( &QSPIHandle ) != QSPI_OK )
    {
        return QSPI_NOT_SUPPORTED;
    }

    return QSPI_OK;
}

/**
 * @brief  De-Initializes the QSPI interface.
 * @retval QSPI memory status
 */
uint8_t BSP_QSPI_DeInit( void )
{
    QSPIHandle.Instance = QUADSPI;

    /* Call the DeInit function to reset the driver */
    if( HAL_QSPI_DeInit( &QSPIHandle ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    /* System level De-initialization */
    BSP_QSPI_MspDeInit( &QSPIHandle, NULL );

    return QSPI_OK;
}

/**
 * @brief  Reads an amount of data from the QSPI memory.
 * @param  pData: Pointer to data to be read
 * @param  ReadAddr: Read start address
 * @param  Size: Size of data to read
 * @retval QSPI memory status
 */
uint8_t BSP_QSPI_Read( uint8_t * pData,
                       uint32_t ReadAddr,
                       uint32_t Size )
{
    QSPI_CommandTypeDef s_command;

    /* Initialize the read command */
    s_command.InstructionMode = QSPI_INSTRUCTION_4_LINES;
    s_command.Instruction = QUAD_INOUT_FAST_READ_DTR_CMD;     /* DTR QUAD INPUT/OUTPUT FAST READ and 4-BYTE DTR FAST READ commands */
    s_command.AddressMode = QSPI_ADDRESS_4_LINES;
    s_command.AddressSize = QSPI_ADDRESS_32_BITS;
    s_command.Address = ReadAddr;
    s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    s_command.DataMode = QSPI_DATA_4_LINES;
    s_command.DummyCycles = MT25TL01G_DUMMY_CYCLES_READ_QUAD_DTR - 1;
    s_command.NbData = Size;
    s_command.DdrMode = QSPI_DDR_MODE_ENABLE;
    s_command.DdrHoldHalfCycle = QSPI_DDR_HHC_HALF_CLK_DELAY;
    s_command.SIOOMode = QSPI_SIOO_INST_EVERY_CMD;

    /* Configure the command */
    if( HAL_QSPI_Command( &QSPIHandle, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    /* Reception of the data */
    if( HAL_QSPI_Receive( &QSPIHandle, pData, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

