FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_M4_AMP_STM32H745I_Discovery_IAR/ST_code/BSP/STM32H745I-Discovery/stm32h745i_discovery_qspi.c
    return QSPI_OK;
}

/**
 * @brief  Writes an amount of data to the QSPI memory.
 * @param  pData: Pointer to data to be written
 * @param  WriteAddr: Write start address
 * @param  Size: Size of data to write
 * @retval QSPI memory status
 */
uint8_t BSP_QSPI_Write( uint8_t * pData,
                        uint32_t WriteAddr,
                        uint32_t Size )
{
    QSPI_CommandTypeDef s_command;
    uint32_t end_addr, current_size, current_addr;

    /* Calculation of the size between the write address and the end of the page */
    current_size = MT25TL01G_PAGE_SIZE - ( WriteAddr % MT25TL01G_PAGE_SIZE );

    /* Check if the size of the data is less than the remaining place in the page */
    if( current_size > Size )
    {
        current_size = Size;
    }

    /* Initialize the address variables */
    current_addr = WriteAddr;
    end_addr = WriteAddr + Size;

    /* Initialize the program command */
    s_command.InstructionMode = QSPI_INSTRUCTION_4_LINES;
    s_command.Instruction = QUAD_IN_FAST_PROG_4_BYTE_ADDR_CMD;
    s_command.AddressMode = QSPI_ADDRESS_4_LINES;
    s_command.AddressSize = QSPI_ADDRESS_32_BITS;
    s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    s_command.DataMode = QSPI_DATA_4_LINES;
    s_command.DummyCycles = 0;
    s_command.DdrMode = QSPI_DDR_MODE_DISABLE;
    s_command.DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY;
    s_command.SIOOMode = QSPI_SIOO_INST_EVERY_CMD;

    /* Perform the write page by page */
    do
    {
        s_command.Address = current_addr;
        s_command.NbData = current_size;

        /* Enable write operations */
        if( QSPI_WriteEnable( &QSPIHandle ) != QSPI_OK )
        {
            return QSPI_ERROR;
        }

        /* Configure the command */
        if( HAL_QSPI_Command( &QSPIHandle, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
        {
            return QSPI_ERROR;
        }

        /* Transmission of the data */
        if( HAL_QSPI_Transmit( &QSPIHandle, pData, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
        {
            return QSPI_ERROR;
        }

        /* Configure automatic polling mode to wait for end of program */
        if( QSPI_AutoPollingMemReady( &QSPIHandle, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != QSPI_OK )
        {
            return QSPI_ERROR;
        }

        /* Update the address and size variables for next page programming */
        current_addr += current_size;
        pData += current_size;
        current_size = ( ( current_addr + MT25TL01G_PAGE_SIZE ) > end_addr ) ? ( end_addr - current_addr ) : MT25TL01G_PAGE_SIZE;
    } while( current_addr < end_addr );

    return QSPI_OK;
}

/**
 * @brief  Erases the specified block of the QSPI memory.
 * @param  BlockAddress: Block address to erase
 * @retval QSPI memory status
 */
uint8_t BSP_QSPI_Erase_Block( uint32_t BlockAddress )
{
    QSPI_CommandTypeDef s_command;

    /* Initialize the erase command */
    s_command.InstructionMode = QSPI_INSTRUCTION_4_LINES;
    s_command.Instruction = SUBSECTOR_ERASE_4_BYTE_ADDR_CMD;
    s_command.AddressMode = QSPI_ADDRESS_4_LINES;
    s_command.AddressSize = QSPI_ADDRESS_32_BITS;
    s_command.Address = BlockAddress;
    s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    s_command.DataMode = QSPI_DATA_NONE;
    s_command.DummyCycles = 0;
    s_command.DdrMode = QSPI_DDR_MODE_DISABLE;
    s_command.DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY;
    s_command.SIOOMode = QSPI_SIOO_INST_EVERY_CMD;

    /* Enable write operations */
    if( QSPI_WriteEnable( &QSPIHandle ) != QSPI_OK )
    {
        return QSPI_ERROR;
    }

    /* Send the command */
    if( HAL_QSPI_Command( &QSPIHandle, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    /* Configure automatic polling mode to wait for end of erase */
    if( QSPI_AutoPollingMemReady( &QSPIHandle, MT25TL01G_SUBSECTOR_ERASE_MAX_TIME ) != QSPI_OK )
    {
        return QSPI_ERROR;
    }

    return QSPI_OK;
}

/**
 * @brief  Erases the entire QSPI memory.
 * @retval QSPI memory status
 */
uint8_t BSP_QSPI_Erase_Chip( void )
{
    QSPI_CommandTypeDef s_command;

    /* Initialize the erase command */
    s_command.InstructionMode = QSPI_INSTRUCTION_4_LINES;
    s_command.Instruction = DIE_ERASE_CMD;
    s_command.AddressMode = QSPI_ADDRESS_NONE;
    s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    s_command.DataMode = QSPI_DATA_NONE;
    s_command.DummyCycles = 0;
    s_command.DdrMode = QSPI_DDR_MODE_DISABLE;
    s_command.DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY;
    s_command.SIOOMode = QSPI_SIOO_INST_EVERY_CMD;

    /* Enable write operations */
    if( QSPI_WriteEnable( &QSPIHandle ) != QSPI_OK )
    {
        return QSPI_ERROR;
    }

    /* Send the command */
    if( HAL_QSPI_Command( &QSPIHandle, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    /* Configure automatic polling mode to wait for end of erase */
    if( QSPI_AutoPollingMemReady( &QSPIHandle, MT25TL01G_DIE_ERASE_MAX_TIME ) != QSPI_OK )
    {
        return QSPI_ERROR;
    }

    return QSPI_OK;
}

/**
 * @brief  Reads current status of the QSPI memory.
 * @retval QSPI memory status
 */
uint8_t BSP_QSPI_GetStatus( void )
{
    QSPI_CommandTypeDef s_command;
    uint16_t reg;

    /* Initialize the read flag status register command */
    s_command.InstructionMode = QSPI_INSTRUCTION_4_LINES;
    s_command.Instruction = READ_FLAG_STATUS_REG_CMD;
    s_command.AddressMode = QSPI_ADDRESS_NONE;
    s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    s_command.DataMode = QSPI_DATA_4_LINES;
    s_command.DummyCycles = 0;
    s_command.NbData = 1;
    s_command.DdrMode = QSPI_DDR_MODE_DISABLE;
    s_command.DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY;
    s_command.SIOOMode = QSPI_SIOO_INST_EVERY_CMD;

    /* Configure the command */
    if( HAL_QSPI_Command( &QSPIHandle, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    /* Reception of the data */
    if( HAL_QSPI_Receive( &QSPIHandle, ( uint8_t * ) ( &reg ), HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    /* Check the value of the register */
    if( ( reg & ( MT25TL01G_FSR_PRERR | MT25TL01G_FSR_PGERR | MT25TL01G_FSR_ERERR ) ) != 0 )
    {
        return QSPI_ERROR;
    }
    else if( ( reg & ( MT25TL01G_FSR_PGSUS | MT25TL01G_FSR_ERSUS ) ) != 0 )
    {
        return QSPI_SUSPENDED;
    }
    else if( ( reg & MT25TL01G_FSR_READY ) != 0 )
    {
        return QSPI_OK;
    }
    else
    {
        return QSPI_BUSY;
    }
}

/**
 * @brief  Return the configuration of the QSPI memory.
 * @param  pInfo: pointer on the configuration structure
 * @retval QSPI memory status
 */
uint8_t BSP_QSPI_GetInfo( QSPI_Info * pInfo )
{
    /* Configure the structure with the memory configuration */
    pInfo->FlashSize = MT25TL01G_FLASH_SIZE;
    pInfo->EraseSectorSize = ( 2 * MT25TL01G_SUBSECTOR_SIZE );
    pInfo->ProgPageSize = MT25TL01G_PAGE_SIZE;
    pInfo->EraseSectorsNumber = ( MT25TL01G_FLASH_SIZE / pInfo->EraseSectorSize );
    pInfo->ProgPagesNumber = ( MT25TL01G_FLASH_SIZE / pInfo->ProgPageSize );

