FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_M4_AMP_STM32H745I_Discovery_IAR/ST_code/BSP/STM32H745I-Discovery/stm32h745i_discovery_qspi.c
    return QSPI_OK;
}

/**
 * @brief  Configure the QSPI in memory-mapped mode
 * @retval QSPI memory status
 */
uint8_t BSP_QSPI_EnableMemoryMappedMode( void )
{
    QSPI_CommandTypeDef s_command;
    QSPI_MemoryMappedTypeDef s_mem_mapped_cfg;

    /* Configure the command for the read instruction */
    s_command.InstructionMode = QSPI_INSTRUCTION_4_LINES;
    s_command.Instruction = QUAD_INOUT_FAST_READ_DTR_CMD;     /* DTR QUAD INPUT/OUTPUT FAST READ and 4-BYTE DTR FAST READ commands */
    s_command.AddressMode = QSPI_ADDRESS_4_LINES;
    s_command.AddressSize = QSPI_ADDRESS_32_BITS;
    s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    s_command.DataMode = QSPI_DATA_4_LINES;
    s_command.DummyCycles = MT25TL01G_DUMMY_CYCLES_READ_QUAD_DTR - 1;

    s_command.DdrMode = QSPI_DDR_MODE_ENABLE;
    s_command.DdrHoldHalfCycle = QSPI_DDR_HHC_HALF_CLK_DELAY;
    s_command.SIOOMode = QSPI_SIOO_INST_EVERY_CMD;

    /* Configure the memory mapped mode */
    s_mem_mapped_cfg.TimeOutActivation = QSPI_TIMEOUT_COUNTER_DISABLE;
    s_mem_mapped_cfg.TimeOutPeriod = 0;

    if( HAL_QSPI_MemoryMapped( &QSPIHandle, &s_command, &s_mem_mapped_cfg ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    return QSPI_OK;
}

/**
 * @brief QSPI MSP Initialization
 *        This function configures the hardware resources used in this example:
 *           - Peripheral's clock enable
 *           - Peripheral's GPIO Configuration
 *           - NVIC configuration for QSPI interrupt
 * @retval None
 */
__weak void BSP_QSPI_MspInit( QSPI_HandleTypeDef * hqspi,
                              void * Params )
{
    GPIO_InitTypeDef gpio_init_structure;

    /*##-1- Enable peripherals and GPIO Clocks #################################*/
    /* Enable the QuadSPI memory interface clock */
    QSPI_CLK_ENABLE();
    /* Reset the QuadSPI memory interface */
    QSPI_FORCE_RESET();
    QSPI_RELEASE_RESET();
    /* Enable GPIO clocks */
    QSPI_CLK_GPIO_CLK_ENABLE();
    QSPI_BK1_CS_GPIO_CLK_ENABLE();
    QSPI_BK1_D0_GPIO_CLK_ENABLE();
    QSPI_BK1_D1_GPIO_CLK_ENABLE();
    QSPI_BK1_D2_GPIO_CLK_ENABLE();
    QSPI_BK1_D3_GPIO_CLK_ENABLE();

    QSPI_BK2_CS_GPIO_CLK_ENABLE();
    QSPI_BK2_D0_GPIO_CLK_ENABLE();
    QSPI_BK2_D1_GPIO_CLK_ENABLE();
    QSPI_BK2_D2_GPIO_CLK_ENABLE();
    QSPI_BK2_D3_GPIO_CLK_ENABLE();

    /*##-2- Configure peripheral GPIO ##########################################*/
    /* QSPI CLK GPIO pin configuration  */
    gpio_init_structure.Pin = QSPI_CLK_PIN;
    gpio_init_structure.Mode = GPIO_MODE_AF_PP;
    gpio_init_structure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio_init_structure.Pull = GPIO_NOPULL;
    gpio_init_structure.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init( QSPI_CLK_GPIO_PORT, &gpio_init_structure );

    /* QSPI CS GPIO pin configuration  */
    gpio_init_structure.Pin = QSPI_BK1_CS_PIN;
    gpio_init_structure.Pull = GPIO_PULLUP;
    gpio_init_structure.Alternate = GPIO_AF10_QUADSPI;
    HAL_GPIO_Init( QSPI_BK1_CS_GPIO_PORT, &gpio_init_structure );

    /* QSPI D0 GPIO pin configuration  */
    gpio_init_structure.Pin = QSPI_BK1_D0_PIN;
    gpio_init_structure.Pull = GPIO_NOPULL;
    gpio_init_structure.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init( QSPI_BK1_D0_GPIO_PORT, &gpio_init_structure );

    gpio_init_structure.Pin = QSPI_BK2_D0_PIN;
    gpio_init_structure.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init( QSPI_BK2_D0_GPIO_PORT, &gpio_init_structure );

    /* QSPI D1 GPIO pin configuration  */
    gpio_init_structure.Pin = QSPI_BK1_D1_PIN;
    gpio_init_structure.Alternate = GPIO_AF10_QUADSPI;
    HAL_GPIO_Init( QSPI_BK1_D1_GPIO_PORT, &gpio_init_structure );

    gpio_init_structure.Pin = QSPI_BK2_D1_PIN;
    gpio_init_structure.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init( QSPI_BK2_D1_GPIO_PORT, &gpio_init_structure );

    /* QSPI D2 GPIO pin configuration  */
    gpio_init_structure.Pin = QSPI_BK1_D2_PIN;
    gpio_init_structure.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init( QSPI_BK1_D2_GPIO_PORT, &gpio_init_structure );

    gpio_init_structure.Pin = QSPI_BK2_D2_PIN;
    HAL_GPIO_Init( QSPI_BK2_D2_GPIO_PORT, &gpio_init_structure );

    /* QSPI D3 GPIO pin configuration  */
    gpio_init_structure.Pin = QSPI_BK1_D3_PIN;
    HAL_GPIO_Init( QSPI_BK1_D3_GPIO_PORT, &gpio_init_structure );

    gpio_init_structure.Pin = QSPI_BK2_D3_PIN;
    HAL_GPIO_Init( QSPI_BK2_D3_GPIO_PORT, &gpio_init_structure );

    /*##-3- Configure the NVIC for QSPI #########################################*/
    /* NVIC configuration for QSPI interrupt */
    HAL_NVIC_SetPriority( QUADSPI_IRQn, 0x0F, 0 );
    HAL_NVIC_EnableIRQ( QUADSPI_IRQn );
}

/**
 * @brief QSPI MSP De-Initialization
 *        This function frees the hardware resources used in this example:
 *          - Disable the Peripheral's clock
 *          - Revert GPIO and NVIC configuration to their default state
 * @retval None
 */
__weak void BSP_QSPI_MspDeInit( QSPI_HandleTypeDef * hqspi,
                                void * Params )
{
    /*##-1- Disable the NVIC for QSPI ###########################################*/
    HAL_NVIC_DisableIRQ( QUADSPI_IRQn );

    /*##-2- Disable peripherals and GPIO Clocks ################################*/
    /* De-Configure QSPI pins */
    HAL_GPIO_DeInit( QSPI_CLK_GPIO_PORT, QSPI_CLK_PIN );
    HAL_GPIO_DeInit( QSPI_BK1_CS_GPIO_PORT, QSPI_BK1_CS_PIN );
    HAL_GPIO_DeInit( QSPI_BK1_D0_GPIO_PORT, QSPI_BK1_D0_PIN );
    HAL_GPIO_DeInit( QSPI_BK1_D1_GPIO_PORT, QSPI_BK1_D1_PIN );
    HAL_GPIO_DeInit( QSPI_BK1_D2_GPIO_PORT, QSPI_BK1_D2_PIN );
    HAL_GPIO_DeInit( QSPI_BK1_D3_GPIO_PORT, QSPI_BK1_D3_PIN );

    HAL_GPIO_DeInit( QSPI_BK2_CS_GPIO_PORT, QSPI_BK2_CS_PIN );
    HAL_GPIO_DeInit( QSPI_BK2_D0_GPIO_PORT, QSPI_BK2_D0_PIN );
    HAL_GPIO_DeInit( QSPI_BK2_D1_GPIO_PORT, QSPI_BK2_D1_PIN );
    HAL_GPIO_DeInit( QSPI_BK2_D2_GPIO_PORT, QSPI_BK2_D2_PIN );
    HAL_GPIO_DeInit( QSPI_BK2_D3_GPIO_PORT, QSPI_BK2_D3_PIN );

    /*##-3- Reset peripherals ##################################################*/
    /* Reset the QuadSPI memory interface */
    QSPI_FORCE_RESET();
    QSPI_RELEASE_RESET();

    /* Disable the QuadSPI memory interface clock */
    QSPI_CLK_DISABLE();
}

/**
 * @}
 */

/** @addtogroup STM32H745I_DISCOVERY_QSPI_Private_Functions
 * @{
 */

/**
 * @brief  This function reset the QSPI memory.
 * @param  hqspi: QSPI handle
 * @retval None
 */
static uint8_t QSPI_ResetMemory( QSPI_HandleTypeDef * hqspi )
{
    QSPI_CommandTypeDef s_command;

    /* Initialize the reset enable command */
    s_command.InstructionMode = QSPI_INSTRUCTION_1_LINE;
    s_command.Instruction = RESET_ENABLE_CMD;
    s_command.AddressMode = QSPI_ADDRESS_NONE;
    s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    s_command.DataMode = QSPI_DATA_NONE;
    s_command.DummyCycles = 0;
    s_command.DdrMode = QSPI_DDR_MODE_DISABLE;
    s_command.DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY;
    s_command.SIOOMode = QSPI_SIOO_INST_EVERY_CMD;

