FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_M4_AMP_STM32H745I_Discovery_IAR/ST_code/BSP/STM32H745I-Discovery/stm32h745i_discovery_qspi.c
    /* Send the command */
    if( HAL_QSPI_Command( hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    /* Send the reset memory command */
    s_command.Instruction = RESET_MEMORY_CMD;

    if( HAL_QSPI_Command( hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    s_command.InstructionMode = QSPI_INSTRUCTION_4_LINES;
    s_command.Instruction = RESET_ENABLE_CMD;

    /* Send the command */
    if( HAL_QSPI_Command( hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    /* Send the reset memory command */
    s_command.Instruction = RESET_MEMORY_CMD;

    if( HAL_QSPI_Command( hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    /* Enter QSPI memory in QPI mode */
    if( QSPI_EnterQPI( &QSPIHandle ) != QSPI_OK )
    {
        return QSPI_ERROR;
    }

    /* Configure automatic polling mode to wait the memory is ready */
    if( QSPI_AutoPollingMemReady( hqspi, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != QSPI_OK )
    {
        return QSPI_ERROR;
    }

    return QSPI_OK;
}

/**
 * @brief  This function set the QSPI memory in 4-byte address mode
 * @param  hqspi: QSPI handle
 * @retval None
 */
static uint8_t QSPI_EnterFourBytesAddress( QSPI_HandleTypeDef * hqspi )
{
    QSPI_CommandTypeDef s_command;

    /* Initialize the command */
    s_command.InstructionMode = QSPI_INSTRUCTION_4_LINES;
    s_command.Instruction = ENTER_4_BYTE_ADDR_MODE_CMD;
    s_command.AddressMode = QSPI_ADDRESS_NONE;
    s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    s_command.DataMode = QSPI_DATA_NONE;
    s_command.DummyCycles = 0;
    s_command.DdrMode = QSPI_DDR_MODE_DISABLE;
    s_command.DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY;
    s_command.SIOOMode = QSPI_SIOO_INST_EVERY_CMD;

    /* Enable write operations */
    if( QSPI_WriteEnable( hqspi ) != QSPI_OK )
    {
        return QSPI_ERROR;
    }

    /* Send the command */
    if( HAL_QSPI_Command( hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    /* Configure automatic polling mode to wait the memory is ready */
    if( QSPI_AutoPollingMemReady( hqspi, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != QSPI_OK )
    {
        return QSPI_ERROR;
    }

    return QSPI_OK;
}

/**
 * @brief  This function configure the dummy cycles on memory side.
 * @param  hqspi: QSPI handle
 * @retval None
 */
static uint8_t QSPI_DummyCyclesCfg( QSPI_HandleTypeDef * hqspi )
{
    QSPI_CommandTypeDef s_command;
    uint16_t reg = 0;

    /* Initialize the read volatile configuration register command */
    s_command.InstructionMode = QSPI_INSTRUCTION_4_LINES;
    s_command.Instruction = READ_VOL_CFG_REG_CMD;
    s_command.AddressMode = QSPI_ADDRESS_NONE;
    s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    s_command.DataMode = QSPI_DATA_4_LINES;
    s_command.DummyCycles = 0;
    s_command.NbData = 2;
    s_command.DdrMode = QSPI_DDR_MODE_DISABLE;
    s_command.DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY;
    s_command.SIOOMode = QSPI_SIOO_INST_EVERY_CMD;

    /* Configure the command */
    if( HAL_QSPI_Command( hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    /* Reception of the data */
    if( HAL_QSPI_Receive( hqspi, ( uint8_t * ) ( &reg ), HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    /* Enable write operations */
    if( QSPI_WriteEnable( hqspi ) != QSPI_OK )
    {
        return QSPI_ERROR;
    }

    /* Update volatile configuration register (with new dummy cycles) */
    s_command.Instruction = WRITE_VOL_CFG_REG_CMD;
    MODIFY_REG( reg, 0xF0F0, ( ( MT25TL01G_DUMMY_CYCLES_READ_QUAD << 4 ) |
                               ( MT25TL01G_DUMMY_CYCLES_READ_QUAD << 12 ) ) );

    /* Configure the write volatile configuration register command */
    if( HAL_QSPI_Command( hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    /* Transmission of the data */
    if( HAL_QSPI_Transmit( hqspi, ( uint8_t * ) ( &reg ), HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    return QSPI_OK;
}

/**
 * @brief  This function send a Write Enable and wait it is effective.
 * @param  hqspi: QSPI handle
 * @retval None
 */
static uint8_t QSPI_WriteEnable( QSPI_HandleTypeDef * hqspi )
{
    QSPI_CommandTypeDef s_command;
    QSPI_AutoPollingTypeDef s_config;

    /* Enable write operations */
    s_command.InstructionMode = QSPI_INSTRUCTION_4_LINES;
    s_command.Instruction = WRITE_ENABLE_CMD;
    s_command.AddressMode = QSPI_ADDRESS_NONE;
    s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    s_command.DataMode = QSPI_DATA_NONE;
    s_command.DummyCycles = 0;
    s_command.DdrMode = QSPI_DDR_MODE_DISABLE;
    s_command.DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY;
    s_command.SIOOMode = QSPI_SIOO_INST_EVERY_CMD;

    if( HAL_QSPI_Command( hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    /* Configure automatic polling mode to wait for write enabling */
    s_config.Match = MT25TL01G_SR_WREN | ( MT25TL01G_SR_WREN << 8 );
    s_config.Mask = MT25TL01G_SR_WREN | ( MT25TL01G_SR_WREN << 8 );
    s_config.MatchMode = QSPI_MATCH_MODE_AND;
    s_config.StatusBytesSize = 2;
    s_config.Interval = 0x10;
    s_config.AutomaticStop = QSPI_AUTOMATIC_STOP_ENABLE;

    s_command.Instruction = READ_STATUS_REG_CMD;
    s_command.DataMode = QSPI_DATA_4_LINES;

    if( HAL_QSPI_AutoPolling( hqspi, &s_command, &s_config, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    return QSPI_OK;
}

/**
 * @brief  This function read the SR of the memory and wait the EOP.
 * @param  hqspi QSPI handle
 * @param  Timeout Autopolling timeout
 * @retval None
 */
static uint8_t QSPI_AutoPollingMemReady( QSPI_HandleTypeDef * hqspi,
                                         uint32_t Timeout )
{
    QSPI_CommandTypeDef s_command;
    QSPI_AutoPollingTypeDef s_config;

    /* Configure automatic polling mode to wait for memory ready */
    s_command.InstructionMode = QSPI_INSTRUCTION_4_LINES;
    s_command.Instruction = READ_STATUS_REG_CMD;
    s_command.AddressMode = QSPI_ADDRESS_NONE;
    s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    s_command.DataMode = QSPI_DATA_4_LINES;
    s_command.DummyCycles = 2;
    s_command.DdrMode = QSPI_DDR_MODE_DISABLE;
    s_command.DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY;
    s_command.SIOOMode = QSPI_SIOO_INST_EVERY_CMD;

    s_config.Match = 0;
    s_config.MatchMode = QSPI_MATCH_MODE_AND;
    s_config.Interval = 0x10;
    s_config.AutomaticStop = QSPI_AUTOMATIC_STOP_ENABLE;
    s_config.Mask = MT25TL01G_SR_WIP | ( MT25TL01G_SR_WIP << 8 );
    s_config.StatusBytesSize = 2;

    if( HAL_QSPI_AutoPolling( hqspi, &s_command, &s_config, Timeout ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    return QSPI_OK;
}

/**
 * @brief  This function enter the QPSI memory in QPI mode
 * @param  hqspi QSPI handle
 * @retval QSPI status
 */
static uint8_t QSPI_EnterQPI( QSPI_HandleTypeDef * hqspi )
{
    QSPI_CommandTypeDef s_command;

    s_command.InstructionMode = QSPI_INSTRUCTION_1_LINE;
    s_command.Instruction = ENTER_QUAD_CMD;
    s_command.AddressMode = QSPI_ADDRESS_NONE;
    s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    s_command.DataMode = QSPI_DATA_NONE;
    s_command.DummyCycles = 0;
    s_command.DdrMode = QSPI_DDR_MODE_DISABLE;
    s_command.DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY;
    s_command.SIOOMode = QSPI_SIOO_INST_EVERY_CMD;

    if( HAL_QSPI_Command( hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
    {
        return QSPI_ERROR;
    }

    return QSPI_OK;
}

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
